Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.CantAssociateWithHostError Property
 The host and the hosted element are misaligned. Possible issues include non-parallel alignment, overlapping geometry, or the offset value being beyond the accepted range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantAssociateWithHostError { get; }
Public Shared ReadOnly Property CantAssociateWithHostError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantAssociateWithHostError {
	FailureDefinitionId^ get ();
}
static member CantAssociateWithHostError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace